haoshengxu/M0/MSPM0G3507_VSCODE/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define GPIO_HFXT_PORT                                                     GPIOA
#define GPIO_HFXIN_PIN                                             DL_GPIO_PIN_5
#define GPIO_HFXIN_IOMUX                                         (IOMUX_PINCM10)
#define GPIO_HFXOUT_PIN                                            DL_GPIO_PIN_6
#define GPIO_HFXOUT_IOMUX                                        (IOMUX_PINCM11)
#define GPIO_LFXT_PORT                                                     GPIOA
#define GPIO_LFXIN_PIN                                             DL_GPIO_PIN_3
#define GPIO_LFXIN_IOMUX                                          (IOMUX_PINCM8)
#define GPIO_LFXOUT_PIN                                            DL_GPIO_PIN_4
#define GPIO_LFXOUT_IOMUX                                         (IOMUX_PINCM9)
#define CPUCLK_FREQ                                                     80000000
/* Defines for SYSPLL_ERR_01 Workaround */
/* Represent 1.000 as 1000 */
#define FLOAT_TO_INT_SCALE                                               (1000U)
#define FCC_EXPECTED_RATIO                                                  2000
#define FCC_UPPER_BOUND                       (FCC_EXPECTED_RATIO * (1 + 0.003))
#define FCC_LOWER_BOUND                       (FCC_EXPECTED_RATIO * (1 - 0.003))

bool SYSCFG_DL_SYSCTL_SYSPLL_init(void);


/* Defines for PWMB */
#define PWMB_INST                                                          TIMA0
#define PWMB_INST_IRQHandler                                    TIMA0_IRQHandler
#define PWMB_INST_INT_IRQN                                      (TIMA0_INT_IRQn)
#define PWMB_INST_CLK_FREQ                                              80000000
/* GPIO defines for channel 0 */
#define GPIO_PWMB_C0_PORT                                                  GPIOA
#define GPIO_PWMB_C0_PIN                                           DL_GPIO_PIN_0
#define GPIO_PWMB_C0_IOMUX                                        (IOMUX_PINCM1)
#define GPIO_PWMB_C0_IOMUX_FUNC                       IOMUX_PINCM1_PF_TIMA0_CCP0
#define GPIO_PWMB_C0_IDX                                     DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 0 */
#define GPIO_PWMB_C0_CMPL_PORT                                             GPIOA
#define GPIO_PWMB_C0_CMPL_PIN                                     DL_GPIO_PIN_22
#define GPIO_PWMB_C0_CMPL_IOMUX                                  (IOMUX_PINCM47)
#define GPIO_PWMB_C0_CMPL_IOMUX_FUNC            IOMUX_PINCM47_PF_TIMA0_CCP0_CMPL

/* GPIO defines for channel 1 */
#define GPIO_PWMB_C1_PORT                                                  GPIOB
#define GPIO_PWMB_C1_PIN                                          DL_GPIO_PIN_20
#define GPIO_PWMB_C1_IOMUX                                       (IOMUX_PINCM48)
#define GPIO_PWMB_C1_IOMUX_FUNC                      IOMUX_PINCM48_PF_TIMA0_CCP1
#define GPIO_PWMB_C1_IDX                                     DL_TIMER_CC_1_INDEX

/* Defines for PWMA */
#define PWMA_INST                                                          TIMA1
#define PWMA_INST_IRQHandler                                    TIMA1_IRQHandler
#define PWMA_INST_INT_IRQN                                      (TIMA1_INT_IRQn)
#define PWMA_INST_CLK_FREQ                                              80000000
/* GPIO defines for channel 0 */
#define GPIO_PWMA_C0_PORT                                                  GPIOA
#define GPIO_PWMA_C0_PIN                                          DL_GPIO_PIN_28
#define GPIO_PWMA_C0_IOMUX                                        (IOMUX_PINCM3)
#define GPIO_PWMA_C0_IOMUX_FUNC                       IOMUX_PINCM3_PF_TIMA1_CCP0
#define GPIO_PWMA_C0_IDX                                     DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_PWMA_C1_PORT                                                  GPIOA
#define GPIO_PWMA_C1_PIN                                          DL_GPIO_PIN_16
#define GPIO_PWMA_C1_IOMUX                                       (IOMUX_PINCM38)
#define GPIO_PWMA_C1_IOMUX_FUNC                      IOMUX_PINCM38_PF_TIMA1_CCP1
#define GPIO_PWMA_C1_IDX                                     DL_TIMER_CC_1_INDEX




/* Defines for OLED */
#define OLED_INST                                                           I2C1
#define OLED_INST_IRQHandler                                     I2C1_IRQHandler
#define OLED_INST_INT_IRQN                                         I2C1_INT_IRQn
#define OLED_BUS_SPEED_HZ                                                 400000
#define GPIO_OLED_SDA_PORT                                                 GPIOB
#define GPIO_OLED_SDA_PIN                                          DL_GPIO_PIN_3
#define GPIO_OLED_IOMUX_SDA                                      (IOMUX_PINCM16)
#define GPIO_OLED_IOMUX_SDA_FUNC                       IOMUX_PINCM16_PF_I2C1_SDA
#define GPIO_OLED_SCL_PORT                                                 GPIOB
#define GPIO_OLED_SCL_PIN                                          DL_GPIO_PIN_2
#define GPIO_OLED_IOMUX_SCL                                      (IOMUX_PINCM15)
#define GPIO_OLED_IOMUX_SCL_FUNC                       IOMUX_PINCM15_PF_I2C1_SCL


/* Defines for IMU */
#define IMU_INST                                                           UART3
#define IMU_INST_FREQUENCY                                              40000000
#define IMU_INST_IRQHandler                                     UART3_IRQHandler
#define IMU_INST_INT_IRQN                                         UART3_INT_IRQn
#define GPIO_IMU_RX_PORT                                                   GPIOB
#define GPIO_IMU_TX_PORT                                                   GPIOA
#define GPIO_IMU_RX_PIN                                           DL_GPIO_PIN_13
#define GPIO_IMU_TX_PIN                                           DL_GPIO_PIN_26
#define GPIO_IMU_IOMUX_RX                                        (IOMUX_PINCM30)
#define GPIO_IMU_IOMUX_TX                                        (IOMUX_PINCM59)
#define GPIO_IMU_IOMUX_RX_FUNC                         IOMUX_PINCM30_PF_UART3_RX
#define GPIO_IMU_IOMUX_TX_FUNC                         IOMUX_PINCM59_PF_UART3_TX
#define IMU_BAUD_RATE                                                   (115200)
#define IMU_IBRD_40_MHZ_115200_BAUD                                         (21)
#define IMU_FBRD_40_MHZ_115200_BAUD                                         (45)
/* Defines for PRINT */
#define PRINT_INST                                                         UART0
#define PRINT_INST_FREQUENCY                                            40000000
#define PRINT_INST_IRQHandler                                   UART0_IRQHandler
#define PRINT_INST_INT_IRQN                                       UART0_INT_IRQn
#define GPIO_PRINT_RX_PORT                                                 GPIOA
#define GPIO_PRINT_TX_PORT                                                 GPIOA
#define GPIO_PRINT_RX_PIN                                         DL_GPIO_PIN_11
#define GPIO_PRINT_TX_PIN                                         DL_GPIO_PIN_10
#define GPIO_PRINT_IOMUX_RX                                      (IOMUX_PINCM22)
#define GPIO_PRINT_IOMUX_TX                                      (IOMUX_PINCM21)
#define GPIO_PRINT_IOMUX_RX_FUNC                       IOMUX_PINCM22_PF_UART0_RX
#define GPIO_PRINT_IOMUX_TX_FUNC                       IOMUX_PINCM21_PF_UART0_TX
#define PRINT_BAUD_RATE                                                 (115200)
#define PRINT_IBRD_40_MHZ_115200_BAUD                                       (21)
#define PRINT_FBRD_40_MHZ_115200_BAUD                                       (45)





/* Defines for ADC12_0 */
#define ADC12_0_INST                                                        ADC0
#define ADC12_0_INST_IRQHandler                                  ADC0_IRQHandler
#define ADC12_0_INST_INT_IRQN                                    (ADC0_INT_IRQn)
#define ADC12_0_ADCMEM_0                                      DL_ADC12_MEM_IDX_0
#define ADC12_0_ADCMEM_0_REF                     DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define ADC12_0_ADCMEM_0_REF_VOLTAGE_V                                       3.3
#define GPIO_ADC12_0_C0_PORT                                               GPIOA
#define GPIO_ADC12_0_C0_PIN                                       DL_GPIO_PIN_27
#define GPIO_ADC12_0_IOMUX_C0                                    (IOMUX_PINCM60)
#define GPIO_ADC12_0_IOMUX_C0_FUNC                (IOMUX_PINCM60_PF_UNCONNECTED)



/* Defines for DMA_CH0 */
#define DMA_CH0_CHAN_ID                                                      (0)
#define ADC12_0_INST_DMA_TRIGGER                      (DMA_ADC0_EVT_GEN_BD_TRIG)


/* Port definition for Pin Group LED1 */
#define LED1_PORT                                                        (GPIOB)

/* Defines for PIN_22: GPIOB.22 with pinCMx 50 on package pin 21 */
#define LED1_PIN_22_PIN                                         (DL_GPIO_PIN_22)
#define LED1_PIN_22_IOMUX                                        (IOMUX_PINCM50)
/* Port definition for Pin Group AD0 */
#define AD0_PORT                                                         (GPIOA)

/* Defines for PIN_31: GPIOA.31 with pinCMx 6 on package pin 39 */
#define AD0_PIN_31_PIN                                          (DL_GPIO_PIN_31)
#define AD0_PIN_31_IOMUX                                          (IOMUX_PINCM6)
/* Port definition for Pin Group AD1 */
#define AD1_PORT                                                         (GPIOA)

/* Defines for PIN_12: GPIOA.12 with pinCMx 34 on package pin 5 */
#define AD1_PIN_12_PIN                                          (DL_GPIO_PIN_12)
#define AD1_PIN_12_IOMUX                                         (IOMUX_PINCM34)
/* Port definition for Pin Group AD2 */
#define AD2_PORT                                                         (GPIOB)

/* Defines for PIN_8: GPIOB.8 with pinCMx 25 on package pin 60 */
#define AD2_PIN_8_PIN                                            (DL_GPIO_PIN_8)
#define AD2_PIN_8_IOMUX                                          (IOMUX_PINCM25)
/* Port definition for Pin Group EN */
#define EN_PORT                                                          (GPIOB)

/* Defines for PIN_27: GPIOB.27 with pinCMx 58 on package pin 29 */
#define EN_PIN_27_PIN                                           (DL_GPIO_PIN_27)
#define EN_PIN_27_IOMUX                                          (IOMUX_PINCM58)
/* Port definition for Pin Group AIN1 */
#define AIN1_PORT                                                        (GPIOA)

/* Defines for PIN_13: GPIOA.13 with pinCMx 35 on package pin 6 */
#define AIN1_PIN_13_PIN                                         (DL_GPIO_PIN_13)
#define AIN1_PIN_13_IOMUX                                        (IOMUX_PINCM35)
/* Port definition for Pin Group AIN2 */
#define AIN2_PORT                                                        (GPIOB)

/* Defines for PIN_26: GPIOB.26 with pinCMx 57 on package pin 28 */
#define AIN2_PIN_26_PIN                                         (DL_GPIO_PIN_26)
#define AIN2_PIN_26_IOMUX                                        (IOMUX_PINCM57)
/* Port definition for Pin Group BIN1 */
#define BIN1_PORT                                                        (GPIOB)

/* Defines for PIN_9: GPIOB.9 with pinCMx 26 on package pin 61 */
#define BIN1_PIN_9_PIN                                           (DL_GPIO_PIN_9)
#define BIN1_PIN_9_IOMUX                                         (IOMUX_PINCM26)
/* Port definition for Pin Group BIN2 */
#define BIN2_PORT                                                        (GPIOB)

/* Defines for PIN_7: GPIOB.7 with pinCMx 24 on package pin 59 */
#define BIN2_PIN_7_PIN                                           (DL_GPIO_PIN_7)
#define BIN2_PIN_7_IOMUX                                         (IOMUX_PINCM24)
/* Port definition for Pin Group E1A */
#define E1A_PORT                                                         (GPIOB)

/* Defines for PIN_E1A: GPIOB.12 with pinCMx 29 on package pin 64 */
// groups represented: ["E1B","E2A","E2B","E1A"]
// pins affected: ["PIN_E1B","PIN_E2A","PIN_E2B","PIN_E1A"]
#define GPIO_MULTIPLE_GPIOB_INT_IRQN                            (GPIOB_INT_IRQn)
#define GPIO_MULTIPLE_GPIOB_INT_IIDX            (DL_INTERRUPT_GROUP1_IIDX_GPIOB)
#define E1A_PIN_E1A_IIDX                                    (DL_GPIO_IIDX_DIO12)
#define E1A_PIN_E1A_PIN                                         (DL_GPIO_PIN_12)
#define E1A_PIN_E1A_IOMUX                                        (IOMUX_PINCM29)
/* Port definition for Pin Group E1B */
#define E1B_PORT                                                         (GPIOB)

/* Defines for PIN_E1B: GPIOB.23 with pinCMx 51 on package pin 22 */
#define E1B_PIN_E1B_IIDX                                    (DL_GPIO_IIDX_DIO23)
#define E1B_PIN_E1B_PIN                                         (DL_GPIO_PIN_23)
#define E1B_PIN_E1B_IOMUX                                        (IOMUX_PINCM51)
/* Port definition for Pin Group E2A */
#define E2A_PORT                                                         (GPIOB)

/* Defines for PIN_E2A: GPIOB.4 with pinCMx 17 on package pin 52 */
#define E2A_PIN_E2A_IIDX                                     (DL_GPIO_IIDX_DIO4)
#define E2A_PIN_E2A_PIN                                          (DL_GPIO_PIN_4)
#define E2A_PIN_E2A_IOMUX                                        (IOMUX_PINCM17)
/* Port definition for Pin Group E2B */
#define E2B_PORT                                                         (GPIOB)

/* Defines for PIN_E2B: GPIOB.5 with pinCMx 18 on package pin 53 */
#define E2B_PIN_E2B_IIDX                                     (DL_GPIO_IIDX_DIO5)
#define E2B_PIN_E2B_PIN                                          (DL_GPIO_PIN_5)
#define E2B_PIN_E2B_IOMUX                                        (IOMUX_PINCM18)




/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);

bool SYSCFG_DL_SYSCTL_SYSPLL_init(void);
void SYSCFG_DL_PWMB_init(void);
void SYSCFG_DL_PWMA_init(void);
void SYSCFG_DL_OLED_init(void);
void SYSCFG_DL_IMU_init(void);
void SYSCFG_DL_PRINT_init(void);
void SYSCFG_DL_ADC12_0_init(void);
void SYSCFG_DL_DMA_init(void);



bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
